{
  "common": {
    "name": "nexowatt-devices",
    "version": "0.5.0",
    "news": {
      "0.2.0": {
        "en": "Rename adapter to a valid id (no dots) and remove any external template references. Add generic built-in templates for Modbus/MQTT/HTTP.",
        "de": "Adapter auf gültige ID umbenannt (keine Punkte) und externe Template-Referenzen entfernt. Generische Built-in-Templates für Modbus/MQTT/HTTP ergänzt."
      },
      "0.3.0": {
        "en": "Added built-in device templates for many EV chargers (EVCS) and energy meters (Modbus). Improved Modbus driver: separate read/write mappings, byteOrder support, and value transforms.",
        "de": "Integrierte Geräte-Templates für viele Ladestationen (EVCS) und Energiezähler (Modbus) hinzugefügt. Modbus-Treiber verbessert: getrennte Read/Write-Mappings, ByteOrder-Unterstützung und Wert-Transformationen."
      },
      "0.3.1": {
        "en": "Fix adminUI definition to prevent Admin crash (adminUI must be an object with config).",
        "de": "adminUI-Definition korrigiert, damit Admin nicht abstürzt (adminUI muss ein Objekt mit config sein)."
      },
      "0.4.0": {
        "en": "Improved admin UI (theme readable, robust without Materialize JS), fixed device add/edit modal, expanded built-in templates (Wallboxes/EVCS + meters + more) and cleaned up legacy naming references.",
        "de": "Admin-UI verbessert (theme-lesbar, robust auch ohne Materialize-JS), Gerät hinzufügen/bearbeiten gefixt, integrierte Templates erweitert (Wallboxen/EVCS + Zähler + mehr) und alte Namensreferenzen bereinigt."
      },
      "0.4.1": {
        "en": "Admin UI: set light-gray page background and switch configuration selects to native selects for maximum compatibility. Add driver count indicator and cache-busting template load.",
        "de": "Admin-UI: hellgrauen Hintergrund gesetzt und Auswahlfelder auf native Selects umgestellt (maximale Kompatibilität). Treiber-Zähler ergänzt und Template-Load mit Cache-Busting verbessert."
      },
      "0.4.2": {
        "en": "Fix Admin config page scripts (adapter-settings.js/translate.js paths) so device selection works. Add automatic migration for invalid adminUI strings on host adapter objects.",
        "de": "Fix für Admin-Konfigseite (korrekte Pfade zu adapter-settings.js/translate.js), damit Geräteauswahl funktioniert. Automatische Migration für ungültige adminUI-Strings in Host-Adapter-Objekten."
      },
      "0.5.0": {
        "en": "Added Modbus RTU bus sharing (RS485), UDP protocol support (e.g. KEBA), expanded built-in device library; improved serial defaults for ED-IPC3020 (/dev/com2).",
        "de": "Modbus RTU Bus-Sharing (RS485) ergänzt, UDP-Protokoll (z.B. KEBA) hinzugefügt, Gerätebibliothek erweitert; bessere RS485-Defaults für ED-IPC3020 (/dev/com2)."
      }
    },
    "title": "NexoWatt Devices",
    "titleLang": {
      "en": "NexoWatt Devices",
      "de": "NexoWatt Devices"
    },
    "desc": {
      "en": "Multi-protocol device adapter (Modbus TCP/RTU, MQTT, HTTP/JSON) with category-based configuration.",
      "de": "Multi-Protokoll Geräteadapter (Modbus TCP/RTU, MQTT, HTTP/JSON) mit kategoriebasierter Konfiguration."
    },
    "authors": [
      "Nexowatt"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "loglevel": "info",
    "icon": "nexowatt-devices.svg",
    "adminUI": {
      "config": "materialize"
    },
    "keywords": [
      "nexowatt",
      "devices",
      "modbus",
      "mqtt",
      "http",
      "energy"
    ],
    "type": "energy",
    "enabled": true,
    "readme": "README.md",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll"
  },
  "native": {
    "pollIntervalMs": 5000,
    "modbusTimeoutMs": 2000,
    "registerAddressOffset": 0,
    "devicesJson": "[]"
  },
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "name": "Connected",
        "type": "boolean",
        "role": "indicator.connected",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}